espressif/esp-idf/components/soc/esp32h2/include/soc/i2s_struct.h
        uint32_t val;
    } rx_timing;
    union {
        struct {
            uint32_t tx_sd_out_dm:  2;               /*The delay mode of I2S Tx SD output signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.*/
            uint32_t reserved2:    14;               /*Reserved*/
            uint32_t tx_ws_out_dm:  2;               /*The delay mode of I2S Tx WS output signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.*/
            uint32_t reserved18:    2;
            uint32_t tx_bck_out_dm: 2;               /*The delay mode of I2S Tx BCK output signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.*/
            uint32_t reserved22:    2;
            uint32_t tx_ws_in_dm:   2;               /*The delay mode of I2S Tx WS input signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.*/
            uint32_t reserved26:    2;
            uint32_t tx_bck_in_dm:  2;               /*The delay mode of I2S Tx BCK input signal. 0: bypass. 1: delay by pos edge.  2: delay by neg edge. 3: not used.*/
            uint32_t reserved30:    2;
        };
        uint32_t val;
    } tx_timing;
    union {
        struct {
            uint32_t fifo_timeout:          8;       /*the i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be triggered when fifo hung counter is equal to this value*/
            uint32_t fifo_timeout_shift:    3;       /*The bits are used to scale tick counter threshold. The tick counter is reset when counter value >= 88000/2^i2s_lc_fifo_timeout_shift*/
            uint32_t fifo_timeout_ena:      1;       /*The enable bit for FIFO timeout*/
            uint32_t reserved12:           20;       /*Reserved*/
        };
        uint32_t val;
    } lc_hung_conf;
    union {
        struct {
            uint32_t rx_eof_num:12;                  /*the length of data to be received. It will trigger i2s_in_suc_eof_int.*/
            uint32_t reserved12:20;                  /*Reserved*/
        };
        uint32_t val;
    } rx_eof_num;
    uint32_t conf_single_data;                     /*the right channel or left channel put out constant value stored in this register according to tx_chan_mod and reg_tx_msb_right*/
    union {
        struct {
            uint32_t tx_idle:    1;                  /*1: i2s_tx is idle state. 0: i2s_tx is working.*/
            uint32_t reserved1: 31;                  /*Reserved*/
        };
        uint32_t val;
    } state;
    uint32_t reserved_70;
    uint32_t reserved_74;
    uint32_t reserved_78;
    uint32_t reserved_7c;
    union {
        struct {
            uint32_t date:      28;                  /*Version control register*/
            uint32_t reserved28: 4;                  /*Reserved*/
        };
        uint32_t val;
    } date;
} i2s_dev_t;
extern i2s_dev_t I2S0;

#ifdef __cplusplus
}
#endif

#endif  /* _SOC_I2S_STRUCT_H_ */
